# Python Libraries for Data ANALYSIS

1. Numpy
2. Pandas
3. Seaborn
4. Matplotlib

### Importing Libraries of interest

In [1]:
import numpy as np 
import pandas as pd
import seaborn as snb
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("custdata.csv", sep ='\t') #Importing the data

#### Section 1

In [3]:
df.shape # checking the shape of teh data

(1000, 11)

In [4]:
df.columns ## checking the column names we are working with

Index(['custid', 'sex', 'is.employed', 'income', 'marital.stat', 'health.ins',
       'housing.type', 'recent.move', 'num.vehicles', 'age', 'state.of.res'],
      dtype='object')

In [5]:
df.head()

,custid,sex,is.employed,income,marital.stat,health.ins,housing.type,recent.move,num.vehicles,age,state.of.res
0,2068,F,NaN,11300,Married,True,Homeowner free and clear,False,2.0,49.0,Michigan
1,2073,F,NaN,0,Married,True,Rented,True,3.0,40.0,Florida
2,2848,M,True,4500,Never Married,False,Rented,True,3.0,22.0,Georgia
3,5641,M,True,20000,Never Married,False,Occupied with no rent,False,0.0,22.0,New Mexico
4,6369,F,True,12000,Never Married,True,Rented,True,1.0,31.0,Florida

In [6]:
# Changing the column names

In [7]:
colnames =['custid', 'sex', 'employed', 'income',
           'mstat', 'hinsurance',
       'htype', 'recentm', 
           'nvehicles', 'age', 'stateofres']

In [8]:
df.columns=colnames

In [9]:
df.columns

Index(['custid', 'sex', 'employed', 'income', 'mstat', 'hinsurance', 'htype',
       'recentm', 'nvehicles', 'age', 'stateofres'],
      dtype='object')

In [10]:
df.tail()

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
995,1411132,F,False,46000,Divorced/Separated,True,Rented,True,1.0,56.0,Florida
996,1411860,F,NaN,5400,Widowed,True,NaN,NaN,NaN,89.0,Pennsylvania
997,1412161,M,True,38500,Married,True,Rented,True,1.0,29.0,Georgia
998,1412971,M,NaN,43400,Married,True,Homeowner free and clear,False,1.0,88.0,Ohio
999,1414286,F,False,20900,Married,False,Rented,False,2.0,36.0,New York

In [11]:
df.isna().sum()  # calculating the total number of missing values.

custid          0
sex             0
employed      328
income          0
mstat           0
hinsurance      0
htype          56
recentm        56
nvehicles      56
age             0
stateofres      0
dtype: int64

In [12]:
df['age'].dtype, df['income'].dtype

(dtype('float64'), dtype('int64'))

In [13]:
df.dtypes

custid          int64
sex            object
employed       object
income          int64
mstat          object
hinsurance       bool
htype          object
recentm        object
nvehicles     float64
age           float64
stateofres     object
dtype: object

In [14]:
df.hinsurance.head()

0     True
1     True
2    False
3    False
4     True
Name: hinsurance, dtype: bool

In [15]:
df.shape # finding the total number of records

(1000, 11)

In [16]:
df.size #finding the total number of element in the data frame

11000

In [17]:
df.columns # displaying column names

Index(['custid', 'sex', 'employed', 'income', 'mstat', 'hinsurance', 'htype',
       'recentm', 'nvehicles', 'age', 'stateofres'],
      dtype='object')

In [18]:
df.dtypes # To display the types of columns we have in the data frame

custid          int64
sex            object
employed       object
income          int64
mstat          object
hinsurance       bool
htype          object
recentm        object
nvehicles     float64
age           float64
stateofres     object
dtype: object

In [19]:
df.describe()# Summary of the numeric columns in the data frame

             custid         income   nvehicles          age
count  1.000000e+03    1000.000000  944.000000  1000.000000
mean   6.984997e+05   53504.771000    1.916314    51.699815
std    4.135083e+05   65478.065729    1.101618    18.863433
min    2.068000e+03   -8700.000000    0.000000     0.000000
25%    3.456668e+05   14600.000000    1.000000    38.000000
50%    6.934030e+05   35000.000000    2.000000    50.000000
75%    1.044606e+06   67000.000000    2.000000    64.000000
max    1.414286e+06  615000.000000    6.000000   146.680197

In [20]:
df[['income','nvehicles','age']].std() # This compute the standard deviation of the numerical columns in the data frame

income       65478.065729
nvehicles        1.101618
age             18.863433
dtype: float64

## This compute the mean values of the first 50 records in the data set

### Method 1

In [21]:
record50 = df.head(50)

In [22]:
mean = record50.mean()

In [23]:
mean

custid        32432.060000
employed          0.968750
income        54512.800000
hinsurance        0.920000
recentm           0.122449
nvehicles         1.775510
age              52.380000
dtype: float64

### Method 2

In [24]:
df.head(50).mean()

custid        32432.060000
employed          0.968750
income        54512.800000
hinsurance        0.920000
recentm           0.122449
nvehicles         1.775510
age              52.380000
dtype: float64

#### Section 2

1.Find how many values in the salary column 

2.Calculate the average income;

3.Calculate the basic statistics for the income column;

In [25]:
#1

In [26]:
df['income'].size

1000

In [27]:
#2

In [28]:
df['income'].mean()

53504.771

In [29]:
# 3

In [30]:
df['income'].describe()

count      1000.000000
mean      53504.771000
std       65478.065729
min       -8700.000000
25%       14600.000000
50%       35000.000000
75%       67000.000000
max      615000.000000
Name: income, dtype: float64

#### Using groupby method in Data Frames

In [31]:
df.head()

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
0,2068,F,NaN,11300,Married,True,Homeowner free and clear,False,2.0,49.0,Michigan
1,2073,F,NaN,0,Married,True,Rented,True,3.0,40.0,Florida
2,2848,M,True,4500,Never Married,False,Rented,True,3.0,22.0,Georgia
3,5641,M,True,20000,Never Married,False,Occupied with no rent,False,0.0,22.0,New Mexico
4,6369,F,True,12000,Never Married,True,Rented,True,1.0,31.0,Florida

In [32]:
df.groupby(['stateofres']).agg(['mean','std','var']).head()

                   custid                                     income  \
                     mean            std           var          mean
stateofres
Alabama     830399.000000  295722.146454  8.745159e+10  23018.181818
Alaska      250652.000000  186454.431098  3.476525e+10  54690.000000
Arizona     934263.777778  388386.056862  1.508437e+11  49455.555556
Arkansas    568287.285714  448048.479286  2.007474e+11  74957.142857
California  715103.590000  419440.701649  1.759305e+11  53263.900000

                                       hinsurance                      \
                     std           var       mean       std       var
stateofres
Alabama     16687.529367  2.784736e+08   0.818182  0.404520  0.163636
Alaska      38978.972536  1.519360e+09   1.000000  0.000000  0.000000
Arizona     52356.616371  2.741215e+09   1.000000  0.000000  0.000000
Arkansas    54579.234670  2.978893e+09   1.000000  0.000000  0.000000
California  65090.182861  4.236732e+09   0.800000  0.402015  0.161616

           nvehicles                            age
                mean       std       var       mean        std          var
stateofres
Alabama     2.100000  1.197219  1.433333  46.181818  17.491816   305.963636
Alaska      2.333333  1.527525  2.333333  62.666667  19.553346   382.333333
Arizona     1.888889  1.269296  1.611111  52.777778  12.901335   166.444444
Arkansas    1.833333  0.752773  0.566667  58.977870  33.817087  1143.595347
California  2.098901  1.106094  1.223443  48.660000  18.360157   337.095354

In [33]:
#Calculate mean income for each marital status:
df.groupby('mstat')[['income']].mean()

                          income
mstat
Divorced/Separated  47756.387097
Married             63166.703488
Never Married       38753.480687
Widowed             46655.739583

In [34]:
#Displays customers whose income is grater than 100000
df_sub = df[df['income'] > 100000]
df_sub.head()

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
5,8322,F,True,180000,Never Married,True,Homeowner with mortgage/loan,False,1.0,40.0,New York
6,8521,M,True,120000,Never Married,True,Homeowner free and clear,True,1.0,39.0,Idaho
11,17134,M,True,220000,Married,True,Homeowner free and clear,True,2.0,33.0,Indiana
14,20383,M,True,170000,Never Married,True,Homeowner with mortgage/loan,True,1.0,35.0,South Carolina
24,31710,F,True,397000,Widowed,True,Homeowner with mortgage/loan,False,2.0,55.0,Missouri

In [35]:
#Displays first 10 female customers whose income is grater than 100000

In [36]:
#income_customers_greater_1000000
income = df[df['income'] > 100000]

In [37]:
income = income[income['sex'] == 'F']

In [38]:
income.head()

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
5,8322,F,True,180000,Never Married,True,Homeowner with mortgage/loan,False,1.0,40.0,New York
24,31710,F,True,397000,Widowed,True,Homeowner with mortgage/loan,False,2.0,55.0,Missouri
43,52436,F,True,139000,Married,True,Homeowner with mortgage/loan,False,2.0,46.0,Pennsylvania
52,65004,F,True,150000,Never Married,True,Homeowner with mortgage/loan,False,4.0,49.0,Florida
82,103389,F,True,130000,Never Married,True,Rented,True,1.0,41.0,Minnesota

In [39]:
df[10:16]

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
10,16551,F,NaN,7000,Married,True,Homeowner with mortgage/loan,False,2.0,46.0,Georgia
11,17134,M,True,220000,Married,True,Homeowner free and clear,True,2.0,33.0,Indiana
12,17946,F,True,85000,Divorced/Separated,True,Rented,False,1.0,51.0,New Hampshire
13,18487,F,True,89200,Divorced/Separated,True,Homeowner with mortgage/loan,False,1.0,63.0,Georgia
14,20383,M,True,170000,Never Married,True,Homeowner with mortgage/loan,True,1.0,35.0,South Carolina
15,22295,M,True,14400,Married,True,Homeowner free and clear,False,3.0,54.0,Pennsylvania

In [40]:
#Select rows by their labels:
df.loc[10:16,['income','sex','mstat']]

    income sex               mstat
10    7000   F             Married
11  220000   M             Married
12   85000   F  Divorced/Separated
13   89200   F  Divorced/Separated
14  170000   M       Never Married
15   14400   M             Married
16   41000   M  Divorced/Separated

In [41]:
#Select rows by their labels:
df.iloc[10:20,[1, 3, 4, 5]]

   sex  income               mstat  hinsurance
10   F    7000             Married        True
11   M  220000             Married        True
12   F   85000  Divorced/Separated        True
13   F   89200  Divorced/Separated        True
14   M  170000       Never Married        True
15   M   14400             Married        True
16   M   41000  Divorced/Separated        True
17   M   30000             Married        True
18   M   80000       Never Married        True
19   M   18800             Married        True

In [42]:
# Create a new data frame from the original sorted by the column Salary
df_sorted = df.sort_values(by ='income')
df_sorted.head(5)

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
691,971703,M,False,-8700,Married,True,Homeowner with mortgage/loan,False,3.0,60.0,Oklahoma
775,1083939,M,NaN,0,Married,True,Homeowner free and clear,False,1.0,73.0,Minnesota
133,167154,M,NaN,0,Never Married,False,NaN,NaN,NaN,31.0,New Jersey
283,396116,F,NaN,0,Married,True,Rented,False,2.0,25.0,South Carolina
713,994628,F,NaN,0,Married,False,Rented,False,2.0,29.0,California

####  sorting  the data using 2 or more columns:

In [43]:
df_sorted = df.sort_values(by = ['income','mstat'],ascending=[True,False])
df_sorted.head(10)

,custid,sex,employed,income,mstat,hinsurance,htype,recentm,nvehicles,age,stateofres
691,971703,M,False,-8700,Married,True,Homeowner with mortgage/loan,False,3.0,60.0,Oklahoma
148,182072,F,NaN,0,Widowed,False,Rented,False,1.0,45.0,Georgia
225,314099,F,NaN,0,Widowed,False,Rented,True,2.0,68.0,Pennsylvania
928,1307013,F,NaN,0,Widowed,False,Rented,False,5.0,55.0,New York
72,90303,M,NaN,0,Never Married,False,NaN,NaN,NaN,45.0,Kentucky
96,115100,M,NaN,0,Never Married,False,NaN,NaN,NaN,29.0,California
123,151678,M,NaN,0,Never Married,False,NaN,NaN,NaN,34.0,Georgia
131,164576,F,NaN,0,Never Married,False,Rented,False,1.0,28.0,Texas
133,167154,M,NaN,0,Never Married,False,NaN,NaN,NaN,31.0,New Jersey
177,220142,F,NaN,0,Never Married,True,NaN,NaN,NaN,18.0,Arkansas

In [44]:
df[['income','age']].agg(['min','mean','max'])

          income         age
min    -8700.000    0.000000
mean   53504.771   51.699815
max   615000.000  146.680197